-- ============================================================================
-- Лабораторная работа №1
-- Основы работы с SQL-запросами: создание запросов и манипуляции с данными
-- Вариант: 21
-- ============================================================================

-- ============================================================================
-- Задание 1.3. Спецпроект (CRUD)
-- ============================================================================
-- 1. CREATE TABLE customers_nyc AS ... (копия клиентов из NYC).

-- 2. DELETE клиентов с индексом 10014.

-- 3. ALTER TABLE ... ADD COLUMN event text.

-- 4. UPDATE ... SET event = 'thank-you party'.

-- ============================================================================
-- Задание 2.3. (CRUD - Локально)
-- ============================================================================
-- 1. Создание таблицы failed_emails (bounced) на основе отскочивших писем.

-- 2. Добавление столбца retry.

-- 3. Заполнение столбца retry значением 'N'.

-- 4. Удаление писем с темой 'Welcome'.

-- 5. Финальная проверка.